artillery/playwright-test.yml
config:
  target: https://ellandi-sandbox.london.cloudapps.digital
  # Enable the Playwright engine:
  phases:
    - duration: 60
      arrivalRate: 1
      maxVUsers: 2
  engines:
    playwright: {}
  processor: "./ellandi-playwright-engine.js"
scenarios:
  - engine: playwright
    flowFunction: "createAccount"
    flow: []